Repository: juusosav/coding-portfolio
Catalog: CodingPortfolioWebsite/SharedResource.*.resx
Languages: fi

# About_Bio1
source: I'm a C# / .NET developer with a passion for building web applications using Blazor. I enjoy creating interactive and user-friendly full-stack experiences using ASP. NET Core, Entity Framework, and SQL databases.
fi: Olen C# ja .NET -kehittäjä, jonka intohimo on tehdä interaktiivisia sekä käyttäjä-lähtöisiä full-stack -ratkaisuja ASP.NET Coren, Entity Frameworkin ja SQL tietokantojen avulla.

# About_Bio2
source: My background is in mainly residential customer services and employment services. This diverse background is a great asset to my journey in the IT world. So don't be a stranger! Contact me if you have software development needs and we can discuss the potential for cooperation.
fi: Osaamistaustani on pääasiassa kiinteistöalan asiakaspalvelussa sekä julkisessa työvoimahallinnossa. Monipuolinen taustani mahdollistaa IT-alalla menestymisen sekä kehittymisen ammattilaisena. Joten otathan yhteyttä mikäli sinulla on tarvetta ohjelmistokehitykselle, jotta voimme keskustella mahdollisesta yhteistyöstä.

# About_Title
source: About Me
fi: Tietoa minusta

# Contact_ContactMe
source: Contact Me
fi: Ota yhteyttä

# Contact_Form_Email
source: Your email
fi: Sähköpostisi

# Contact_Form_Message
source: Your message
fi: Viestisi

# Contact_Form_Name
source: Your name
fi: Nimesi

# Contact_SendMessage
source: Send Message
fi: Lähetä viesti

# Contact_Sending
source: Sending...
fi: Lähettää...

# Contact_StatusMessageSent
source: Message sent successfully!
fi: Viesti lähetetty onnistuneesti!

# Contant_StatusMessageSendFailed
source: Failed to send message. Please try again later.
fi: Viestin lähetys epäonnistui. Ole hyvä ja yritä myöhemmin uudelleen.

# HeroPhrase_Blazor
source: Blazor Developer
fi: Blazor Kehittäjä

# HeroPhrase_CSharp
source: C# Enthusiast
fi: C# Intoilija

# HeroPhrase_FullStack
source: Full-Stack Engineer
fi: Full-Stack Kehittäjä

# HeroPhrase_Intro
source: I am a
fi: Olen

# Hero_CVButton
source: Download My CV
fi: Lataa CV:ni

# Hero_Name
source: Hi, I'm Juuso
fi: Hei, olen Juuso

# Hero_WorkButton
source: View My Work
fi: Katso töitäni

# Nav_About
source: About
fi: Tietoja

# Nav_Contact
source: Contact
fi: Ota yhteyttä

# Nav_Projects
source: Projects
fi: Projektit

# Nav_TechStack
source: Tech Stack
fi: Teknologiat

# Project_ExpenseTracker_Desc
source: A console application to track personal expenses, built with C#. Data persistence with JSON.
fi: Konsoliohjelma henkilökohtaiseen kuluseurantaan C# -kielellä. Datan pysyvyys JSON -muodossa.

# Project_ExpenseTracker_Title
source: Expense Tracker
fi: Kuluseuranta -ohjelma

# Project_HabitTracker_Desc
source: A habit tracker application built in Blazor/.NET. Live demo hosted on Microsoft Azure.
fi: Tapaseuranta-ohjelmisto, joka on tehty Blazorilla ja .NET:lla. Livedemo löytyy Microsoft Azuresta.

# Project_HabitTracker_Title
source: Habit Tracker
fi: Tapaseuranta -ohjelma

# Project_PortfolioSite_Desc
source: This portfolio website itself is made with Blazor WASM (WebAssembly).
fi: Tämä koodausportfolio on tehty itsessään Blazor WASM (WebAssembly) -ohjelmistokehyksellä.

# Project_PortfolioSite_Title
source: Portfolio Website
fi: Portfolio -nettisivu

# Project_Title
source: Projects
fi: Projektit

# Project_ViewButton
source: View
fi: Tutustu

# TechStack_CloudComputing
source: Cloud Computing
fi: Pilvipalvelut

# TechStack_Databases
source: Databases
fi: Tietokannat

# TechStack_ProgrammingLangs
source: Programming Languages
fi: Ohjelmointikielet

# TechStack_Title
source: Tech Stack
fi: Teknologiat

# TechStack_WebDevelopment
source: Web Development
fi: Web-kehitys

# NavMenu_BackToTop
source: Back To Top
fi: Alkuun
